app/views/users/users/_form.html.erb

        <div class="col-sm-9">
          <%= collection_check_boxes(:curse, :curses_ids, Curse.all, :id, :title) do |b| %>
---
SELECT "curses".* FROM "curses"