app/views/contents/_form.html.erb


<%= collection_radio_buttons(:content, :curse_id, Curse.all, :id, :title ) do |b| %>
---
SELECT "curses".* FROM "curses"