app/views/contents/index.html.erb

                          <td><%= licao.title %></td>
                          <td><span class="badge badge-pill badge-secondary"><%= licao.contents.count %></span> </td>
---
SELECT "contents".* FROM "contents" WHERE (curse_id = '1')