app/views/page/_curses.html.erb

SELECT "curses"."id" FROM "curses" INNER JOIN "curses_users" ON "curses"."id" = "curses_users"."curse_id" WHERE "curses_users"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "curses" INNER JOIN "curses_users" ON "curses"."id" = "curses_users"."curse_id" WHERE "curses_users"."user_id" = ?  [["user_id", 2]]
---
              <span class="stats-small__label text-uppercase">Meus Cursos</span>
              <h6 class="stats-small__value count my-3"> <%= current_user.curse.count %> </h6>