app/views/messagers/_form.html.erb

SELECT "users".* FROM "users"
---
        <label class="form-control-label"><%= f.label :subject %></label>
        <%= collection_select(:messager, :user_id, User.all, :id, :name_with_initial, prompt: true,  multiple: true) %>