app/views/curses/_form.html.erb

SELECT "categories".* FROM "categories"
---
          <div class="col-sm-9">
          <%= collection_check_boxes(:category, :curse_ids, Category.all, :id, :name ) do |b| %>