app/views/curses/home.html.erb


        <% if  licao.progress.exists? == true %>
---
SELECT "progresses".* FROM "progresses"