app/controllers/categories_controller.rb

  def index
    @category = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(set_params)
    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "PHP"], ["created_at", "2018-03-22 16:15:39.353868"], ["updated_at", "2018-03-22 16:15:39.353868"]]