app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents" WHERE (curse_id = '1')
---
  def index

    @contents = Content.all

INSERT INTO "contents" ("title", "body", "doc", "created_at", "updated_at", "curse_id", "publish_on", "days") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @content = Content.new(content_params)

    respond_to do |format|
      if @content.save

INSERT INTO "contents" ("title", "body", "doc", "created_at", "updated_at", "curse_id", "publish_on", "days") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def duplicate

    @new = @content.dup
    @new.title = "#Copy #{@new.title}"

    respond_to do |format|
      if @new.save

UPDATE "contents" SET "title" = ?, "publish_on" = ?, "days" = ?, "updated_at" = ? WHERE "contents"."id" = ?  [["title", "Aula  5"], ["publish_on", "2018-03-23 01:29:00"], ["days", 4], ["updated_at", "2018-03-22 16:31:40.268214"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @content.update(content_params)

DELETE FROM "contents" WHERE "contents"."id" = ?  [["id", 7]]
---
  def destroy
    @content.destroy

SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_content
      @content = Content.find(params[:id])