app/controllers/curses_controller.rb

def index
@curses = Curse.all
---
SELECT "curses".* FROM "curses"

def create
  @curse = Curse.new(set_params)

  respond_to do |format|
    if @curse.save
---
INSERT INTO "curses" ("title", "descricao", "picture", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)

def update
   respond_to do |format|
     if @curse.update(set_params)
---
UPDATE "curses" SET "title" = ?, "category_id" = ?, "updated_at" = ? WHERE "curses"."id" = ?  [["title", "O Segredo dos Smartphone "], ["category_id", 1], ["updated_at", "2018-03-18 17:11:58.014876"], ["id", 1]]

def set_curse
  @curse = Curse.find(params[:id])
---
SELECT  "curses".* FROM "curses" WHERE "curses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]