app/controllers/messagers_controller.rb

  def create
    @messager =  Messager.new(messager_params)

    respond_to do |format|
      if @messager.save
---
INSERT INTO "messagers" ("subject", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["subject", ""], ["body", ""], ["user_id", 1], ["created_at", "2018-03-16 17:48:54.302498"], ["updated_at", "2018-03-16 17:48:54.302498"]]

  def destroy

    @messager.destroy
---
DELETE FROM "messagers" WHERE "messagers"."id" = ?  [["id", 1]]

  def set_messager
    @messager = Messager.find(params[:id])
---
SELECT  "messagers".* FROM "messagers" WHERE "messagers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]