app/controllers/page_controller.rb

def index

  @user = current_user
  @user_total = User.all
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"