app/controllers/progresses_controller.rb

INSERT INTO "progresses" ("progress", "user_id", "content_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["progress", 1], ["user_id", 2], ["content_id", 1], ["created_at", "2018-03-21 20:47:36.174844"], ["updated_at", "2018-03-21 20:47:36.174844"]]
---
def create
respond_to do |format|
 @progress = Progress.new(set_params)
  if @progress.save