app/controllers/progresses_controller.rb

def set_progress

  @progress = Content.find(params[:id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]